[
  {
    "image": "https://i.ibb.co.com/9DK3CLX/Taskflow-logo.png",
    "title": "TaskFlow",
    "companyName": "NextGen Labs",
    "id": 1,
    "description": "TaskFlow is an AI-powered productivity and organization app that helps users plan, prioritize, and execute their daily goals effectively. It combines intuitive task lists, project boards, and smart reminders to optimize your workflow. The app learns your habits and schedules through machine learning, suggesting ideal times for work, rest, and collaboration. TaskFlow also allows team coordination through shared workspaces, file attachments, and deadline tracking. Its progress visualizations and daily performance summaries motivate users to stay consistent. Whether for students managing coursework or professionals handling complex projects, TaskFlow adapts to different productivity styles. Offline functionality and secure cloud syncing make it dependable anywhere. With its minimal interface, advanced reminders, and calendar integration, TaskFlow ensures that you stay focused, efficient, and always one step ahead.",
    "size": 45,
    "reviews": "3.1k",
    "ratingAvg": 4.7,
    "downloads": "125k",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 270 },
      { "name": "4 star", "count": 860 },
      { "name": "5 star", "count": 1784 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/RpWxb8vK/Fit-track.jpg",
    "title": "FitTrack",
    "companyName": "HealthSync",
    "id": 2,
    "description": "FitTrack is a complete health and fitness tracking solution designed to make wellness accessible and enjoyable. It provides personalized workout routines, calorie tracking, and AI-based progress insights. From gym workouts to yoga and running, FitTrack tailors exercises to your fitness goals and skill level. The app supports integration with smartwatches and wearables, syncing real-time data like steps, heart rate, and calories burned. Nutrition tracking allows users to log meals and monitor macro intake with ease. FitTrack’s community challenges, leaderboards, and progress milestones keep motivation high. HealthSync’s built-in analytics help you monitor improvements in strength, endurance, and recovery over time. With its sleek interface and dynamic guidance, FitTrack ensures your fitness journey is effective, balanced, and sustainable.",
    "size": 82,
    "reviews": "2.5k",
    "ratingAvg": 4.5,
    "downloads": "97k",
    "ratings": [
      { "name": "1 star", "count": 95 },
      { "name": "2 star", "count": 156 },
      { "name": "3 star", "count": 340 },
      { "name": "4 star", "count": 820 },
      { "name": "5 star", "count": 1129 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TxsHcmg0/Tune-Stream.jpg",
    "title": "TuneStream",
    "companyName": "MelodyHub",
    "id": 3,
    "description": "TuneStream redefines the music experience with personalized playlists and AI-powered recommendations. The app analyzes your listening habits to create mood-based mixes—whether you’re studying, relaxing, or on the go. With offline mode and high-fidelity sound, you can enjoy uninterrupted music anywhere. TuneStream also allows users to follow artists, explore curated playlists, and discover trending tracks globally. Its “FocusFlow” and “ChillVibes” modes blend ambient and lyrical music for productivity or calm. Artists can upload music, gain insights, and connect with fans directly through the platform. Designed with simplicity and clarity, TuneStream brings together art, technology, and personalization to help users rediscover music that resonates with their soul.",
    "size": 76,
    "reviews": "6.0k",
    "ratingAvg": 4.8,
    "downloads": "3.2M",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 220 },
      { "name": "3 star", "count": 340 },
      { "name": "4 star", "count": 1080 },
      { "name": "5 star", "count": 4250 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLypb8hk/Trip-Ease.jpg",
    "title": "TripEase",
    "companyName": "VoyageWorks",
    "id": 4,
    "description": "TripEase makes travel planning simple and stress-free. It allows users to organize itineraries, book hotels and transport, and share travel experiences seamlessly. The app provides real-time flight alerts, destination guides, and budget calculators to help travelers make smart choices. Group trip coordination features let friends plan together, while AI recommendations suggest attractions, restaurants, and routes based on your interests. TripEase’s offline maps and translation tools ensure convenience even without internet access. With built-in weather forecasts and expense tracking, it becomes your all-in-one travel assistant. From spontaneous weekend getaways to detailed international tours, TripEase makes exploration effortless and enjoyable.",
    "size": 60,
    "reviews": "1.4k",
    "ratingAvg": 4.6,
    "downloads": "86k",
    "ratings": [
      { "name": "1 star", "count": 42 },
      { "name": "2 star", "count": 76 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 410 },
      { "name": "5 star", "count": 784 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fG0YfRDP/Money-Mate.png",
    "title": "MoneyMate",
    "companyName": "FinSage",
    "id": 5,
    "description": "MoneyMate is a smart financial management app designed to simplify budgeting, expense tracking, and saving. It automatically categorizes transactions, tracks spending habits, and provides AI insights for better financial decisions. Users can set monthly goals, monitor cash flow, and receive reminders to stay within budget. The clean dashboard displays income, savings, and expenses visually through charts and reports. MoneyMate’s forecasting tool predicts future spending trends and offers suggestions for saving more efficiently. Integration with banks ensures secure data sync, while manual entries allow flexibility. Ideal for individuals and families, MoneyMate empowers users to achieve financial stability and smarter money management.",
    "size": 42,
    "reviews": "3.2k",
    "ratingAvg": 4.4,
    "downloads": "143k",
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 850 },
      { "name": "5 star", "count": 1590 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4gmkZ3hY/Snap-Edit.png",
    "title": "SnapEdit",
    "companyName": "PixelForge",
    "id": 6,
    "description": "SnapEdit is a powerful AI-driven photo editing app that transforms images in seconds. It offers professional-grade tools like background removal, filters, and object erasing with just one tap. Users can enhance colors, apply creative effects, and create stunning collages effortlessly. SnapEdit’s intuitive interface is designed for both beginners and professionals, providing presets for social media posts, portraits, and landscapes. The AI automatically adjusts brightness, sharpness, and contrast to deliver studio-quality results. With cloud saving, users can edit across devices and store projects securely. Whether retouching a selfie or creating a digital masterpiece, SnapEdit brings creativity to everyone’s fingertips.",
    "size": 70,
    "reviews": "5.1k",
    "ratingAvg": 4.8,
    "downloads": "3.9M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 960 },
      { "name": "5 star", "count": 3590 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tMzq5Y8H/Shop-Link.jpg",
    "title": "ShopLink",
    "companyName": "MarketGrid",
    "id": 7,
    "description": "ShopLink is your one-stop online shopping hub for discovering top brands, deals, and exclusive offers. The app provides a smooth, personalized shopping experience by learning your preferences and recommending items accordingly. From fashion and electronics to home essentials, ShopLink offers a wide product range with verified reviews and secure payment options. Users can track orders in real-time, save favorite products, and receive instant alerts on flash sales. The loyalty rewards program makes shopping even more rewarding. With fast loading times, multilingual support, and buyer protection, ShopLink ensures that online shopping is safe, convenient, and enjoyable.",
    "size": 88,
    "reviews": "7.8k",
    "ratingAvg": 4.6,
    "downloads": "540k",
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 290 },
      { "name": "3 star", "count": 640 },
      { "name": "4 star", "count": 1780 },
      { "name": "5 star", "count": 4900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Gvr6ShWr/Edu-verse.jpg",
    "title": "EduVerse",
    "companyName": "LearnSphere",
    "id": 8,
    "description": "EduVerse revolutionizes online education with interactive courses, video lessons, and live mentorship. It covers a wide range of subjects—from coding and business to creative arts—tailored for learners of all ages. AI progress tracking identifies strengths and weaknesses, offering customized learning paths. The app includes quizzes, certification tests, and discussion forums for collaboration. Students can download lessons for offline study and earn verified certificates upon completion. EduVerse’s vibrant community of instructors ensures engaging and up-to-date content. Designed for accessibility and motivation, EduVerse empowers learners to upgrade skills anytime, anywhere.",
    "size": 120,
    "reviews": "2.1k",
    "ratingAvg": 4.5,
    "downloads": "184k",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 580 },
      { "name": "5 star", "count": 960 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q7hh30QJ/Daily-Pulse.jpg",
    "title": "DailyPulse",
    "companyName": "InfoStream",
    "id": 9,
    "description": "DailyPulse curates the most relevant global and local news to match your interests. Using AI, it filters stories by category, tone, and credibility, ensuring a clean and reliable reading experience. The app offers sections for business, technology, sports, and entertainment, along with personalized alerts for breaking news. Users can bookmark articles, listen via text-to-speech, and share directly on social platforms. Its minimal interface encourages distraction-free reading, while the comment sections foster healthy discussions. With offline reading mode and daily summaries, DailyPulse keeps you informed without overwhelming you—your intelligent companion for smarter news consumption.",
    "size": 38,
    "reviews": "4.2k",
    "ratingAvg": 4.2,
    "downloads": "175k",
    "ratings": [
      { "name": "1 star", "count": 260 },
      { "name": "2 star", "count": 380 },
      { "name": "3 star", "count": 820 },
      { "name": "4 star", "count": 1180 },
      { "name": "5 star", "count": 1560 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/08sRTGn/Sky-cast.png",
    "title": "SkyCast",
    "companyName": "WeatherPro",
    "id": 10,
    "description": "SkyCast provides hyper-accurate weather forecasts powered by satellite imagery and AI prediction models. It delivers real-time updates on temperature, humidity, rainfall, and air quality. The interactive radar map visualizes storms and weather movements globally. Users can set alerts for extreme weather conditions and customize widgets for home screens. SkyCast’s sleek interface and adaptive theme make it both functional and elegant. Travelers benefit from multi-city tracking and UV index data. Designed for precision and simplicity, SkyCast ensures you’re always prepared—whether you’re planning a picnic, commute, or outdoor adventure.",
    "size": 30,
    "reviews": "3.0k",
    "ratingAvg": 4.3,
    "downloads": "154k",
    "ratings": [
      { "name": "1 star", "count": 110 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1590 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLN0tmXQ/Chatterly.jpg",
    "title": "Chatterly",
    "companyName": "Connectify",
    "id": 11,
    "description": "Chatterly is a social media app that connects people through photos, videos, and short stories in real time. It emphasizes creativity, authenticity, and positive engagement. Users can share posts, host live streams, and join topic-based communities. Smart algorithms highlight relevant content instead of random trends, ensuring meaningful interaction. Built-in privacy controls let users manage who views their profile and posts. The app also includes chat groups, reactions, and story filters for self-expression. With fast performance and a global network, Chatterly redefines social media as a space for genuine connection and creativity.",
    "size": 110,
    "reviews": "8.8k",
    "ratingAvg": 4.5,
    "downloads": "840k",
    "ratings": [
      { "name": "1 star", "count": 390 },
      { "name": "2 star", "count": 470 },
      { "name": "3 star", "count": 940 },
      { "name": "4 star", "count": 2180 },
      { "name": "5 star", "count": 4820 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vyqVRjt/Lingua-Pro.png",
    "title": "LinguaPro",
    "companyName": "PolyLearn",
    "id": 12,
    "description": "LinguaPro is an advanced language-learning app designed to make fluency achievable through immersive practice. It includes lessons in reading, writing, speaking, and listening, supported by AI pronunciation correction and real-time feedback. Flashcards, translation tools, and voice chat with native speakers enhance understanding. The adaptive learning engine customizes difficulty based on progress, making it ideal for beginners or professionals. Offline access ensures learning continuity anywhere. With gamified streaks and progress milestones, LinguaPro turns language study into an engaging daily habit that delivers measurable improvement.",
    "size": 64,
    "reviews": "4.5k",
    "ratingAvg": 4.8,
    "downloads": "260k",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 780 },
      { "name": "5 star", "count": 3270 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N2KFVLPq/Safe-Net.jpg",
    "title": "SafeNet",
    "companyName": "CyberVault",
    "id": 13,
    "description": "SafeNet is a cybersecurity and privacy app that protects users from online threats, malware, and identity theft. It continuously scans for unsafe networks, phishing links, and data leaks, alerting users instantly. The app’s VPN service encrypts internet traffic, ensuring safe browsing across public Wi-Fi. Password manager and breach reports add extra layers of security. SafeNet’s lightweight design ensures minimal battery use while maintaining robust protection. Developed by CyberVault, the app gives users peace of mind in an increasingly connected world—guarding data, privacy, and digital identity around the clock.",
    "size": 90,
    "reviews": "3.7k",
    "ratingAvg": 4.6,
    "downloads": "195k",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 910 },
      { "name": "5 star", "count": 2210 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vxQFXXfp/Maply.jpg",
    "title": "Maple",
    "companyName": "GeoVision",
    "id": 14,
    "description": "Maply is a modern navigation and mapping app that offers precise routes, live traffic updates, and offline map access. Its AI-powered route optimization helps drivers and travelers save time by avoiding congestion and roadblocks. The app also highlights nearby attractions, fuel stations, and emergency services. Users can share real-time locations with friends and mark favorite places for quick access. With clear visuals, voice navigation, and frequent updates, Maply enhances the travel experience for everyone—from daily commuters to adventure explorers. Reliability and accuracy make Maply an essential navigation partner.",
    "size": 150,
    "reviews": "5.0k",
    "ratingAvg": 4.4,
    "downloads": "310k",
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 310 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1020 },
      { "name": "5 star", "count": 2940 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yntYdBfy/Quick-Bite.png",
    "title": "QuickBite",
    "companyName": "Foodly",
    "id": 15,
    "description": "QuickBite connects users with local restaurants, offering fast food delivery and real-time order tracking. It provides detailed menus, ratings, and estimated delivery times for transparent choices. Personalized recommendations highlight your favorite cuisines, while special discounts encourage new discoveries. The app also allows dine-in reservations and group ordering. Delivery partners are GPS-tracked for accuracy, ensuring your meals arrive hot and fresh. With secure payments, quick reorders, and reward points, QuickBite makes enjoying your favorite meals simpler than ever—perfect for busy lifestyles and food lovers alike.",
    "size": 65,
    "reviews": "9.1k",
    "ratingAvg": 4.3,
    "downloads": "620k",
    "ratings": [
      { "name": "1 star", "count": 540 },
      { "name": "2 star", "count": 710 },
      { "name": "3 star", "count": 1250 },
      { "name": "4 star", "count": 2100 },
      { "name": "5 star", "count": 4500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q33r4r8c/Calm-Space.png",
    "title": "CalmSpace",
    "companyName": "MindEase",
    "id": 16,
    "description": "CalmSpace is a mindfulness app focused on helping users relax, sleep better, and manage stress. It offers guided meditation sessions, ambient soundscapes, and breathing exercises curated by mental wellness experts. Users can personalize routines for morning focus or nighttime rest. The app’s “Sleep Stories” feature narrates soothing tales to promote deep rest. Progress tracking shows daily mindfulness streaks and stress reduction trends. With its minimal design, gentle visuals, and offline playback, CalmSpace provides a pocket-sized sanctuary for mental balance and emotional well-being.",
    "size": 58,
    "reviews": "2.7k",
    "ratingAvg": 4.9,
    "downloads": "180k",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 460 },
      { "name": "5 star", "count": 2050 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/C50gR9Cd/Note-Sync.png",
    "title": "NoteSync",
    "companyName": "CloudTools",
    "id": 17,
    "description": "NoteSync is a smart note-taking app designed for efficiency and synchronization across devices. It allows users to capture ideas instantly through text, voice, or images. Every note is automatically stored in the cloud, ensuring no data loss. With powerful search and tag systems, you can retrieve any note within seconds. Collaboration tools let multiple users edit in real time, making it perfect for students and professionals. Markdown support and to-do integration enhance functionality. Fast, lightweight, and secure, NoteSync ensures your ideas are always organized and accessible.",
    "size": 34,
    "reviews": "2.0k",
    "ratingAvg": 4.7,
    "downloads": "150k",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1050 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xSq52pRT/Pixel-Quest.jpg",
    "title": "PixelQuest",
    "companyName": "GameForge",
    "id": 18,
    "description": "PixelQuest is an action-adventure game where creativity meets strategy. Players embark on epic quests, explore vivid worlds, and customize characters with unique abilities. The game features multiplayer challenges, story-driven missions, and AI-enhanced environments. Regular updates bring new levels, skins, and seasonal events to keep gameplay exciting. Its graphics and sound design create an immersive experience, while leaderboards and achievements encourage competition. PixelQuest blends fun, imagination, and teamwork—perfect for gamers seeking endless exploration and excitement.",
    "size": 180,
    "reviews": "11.2k",
    "ratingAvg": 4.6,
    "downloads": "980k",
    "ratings": [
      { "name": "1 star", "count": 650 },
      { "name": "2 star", "count": 810 },
      { "name": "3 star", "count": 1550 },
      { "name": "4 star", "count": 2980 },
      { "name": "5 star", "count": 6210 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/3mCMZZ8K/beatcraft-logo-a.png",
    "title": "BeatCraft",
    "companyName": "SoundForge",
    "id": 19,
    "description": "BeatCraft is a dynamic music creation app that allows users to compose, mix, and master beats effortlessly. With AI-assisted tools, users can experiment with loops, samples, and virtual instruments in real time. Its drag-and-drop interface makes beat-making intuitive, even for beginners. Advanced users can fine-tune tracks with equalizers, filters, and layered sound effects. The app also enables exporting to multiple formats for professional use. Whether producing hip-hop, EDM, or lo-fi, BeatCraft helps creators turn ideas into powerful tracks instantly.",
    "size": 95,
    "reviews": "4.2k",
    "ratingAvg": 4.8,
    "downloads": "2.9M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 240 },
      { "name": "4 star", "count": 640 },
      { "name": "5 star", "count": 3180 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DjRc5DM/City-Scoutes.png",
    "title": "CityScout",
    "companyName": "UrbanTech",
    "id": 20,
    "description": "CityScout is your interactive city discovery companion. It helps users explore hidden attractions, local events, and restaurants through an immersive map interface. Using augmented reality, CityScout overlays real-time information about landmarks, ratings, and directions. Travelers can bookmark spots, follow city guides, and share experiences with friends. The AI-based recommendation engine tailors suggestions to your preferences—whether nightlife, history, or dining. With offline navigation and live event tracking, CityScout transforms ordinary outings into exciting adventures full of discovery and connection.",
    "size": 85,
    "reviews": "3.1k",
    "ratingAvg": 4.5,
    "downloads": "230k",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 340 },
      { "name": "4 star", "count": 780 },
      { "name": "5 star", "count": 1670 }
    ]
  }
]
